kilkist = int(input('Введіть кількість паралельно підключених провідників, не більш ніж 5: '))

if kilkist <= 1:
    print('Провідників 1 чи менше')
elif kilkist == 2:
    R1 = float(input('Введіть електричний опір першого провідника: '))
    R2 = float(input('Введіть електричний опір другого провідника: '))
    Rz = 1 / (1/R1 + 1/R2)
    print('Загальний електричний опір становить:', Rz, 'ом')
elif kilkist == 3:
    R1 = float(input('Введіть електричний опір першого провідника: '))
    R2 = float(input('Введіть електричний опір другого провідника: '))
    R3 = float(input('Введіть електричний опір третього провідника: '))
    Rz = 1 / (1/R1 + 1/R2 + 1/R3)
    print('Загальний електричний опір становить:', Rz, 'ом')
elif kilkist == 4:
    R1 = float(input('Введіть електричний опір першого провідника: '))
    R2 = float(input('Введіть електричний опір другого провідника: '))
    R3 = float(input('Введіть електричний опір третього провідника: '))
    R4 = float(input('Введіть електричний опір четвертого провідника: '))
    Rz = 1 / (1/R1 + 1/R2 + 1/R3 + 1/R4)
    print('Загальний електричний опір становить:', Rz, 'ом')
elif kilkist == 5:
    R1 = float(input('Введіть електричний опір першого провідника: '))
    R2 = float(input('Введіть електричний опір другого провідника: '))
    R3 = float(input('Введіть електричний опір третього провідника: '))
    R4 = float(input('Введіть електричний опір четвертого провідника: '))
    R5 = float(input('Введіть електричний опір 5-го провідника: '))
    Rz = 1 / (1/R1 + 1/R2 + 1/R3 + 1/R4 + 1/R5)
    print('Загальний електричний опір становить:', Rz, 'ом')
else: print('Провідників більш, ніж 5. Спочатку виправте код. :)')
