kilkist = int(input('Введіть кількість паралельно підключених провідників, не більш чотирьох: '))

if kilkist <= 1:
    print('Провідників 1 чи менше')
elif kilkist == 2:
    R1 = int(input('Введіть електричний опір першого провідника: '))
    R2 = int(input('Введіть електричний опір другого провідника: '))
    Rz = 1 / (1/R1 + 1/R2)
    print('Загальний електричний опір становить:', Rz, 'ом')
elif kilkist == 3:
    R1 = int(input('Введіть електричний опір першого провідника: '))
    R2 = int(input('Введіть електричний опір другого провідника: '))
    R3 = int(input('Введіть електричний опір третього провідника: '))
    Rz = 1 / (1/R1 + 1/R2 + 1/R3)
    print('Загальний електричний опір становить:', Rz, 'ом')
elif kilkist == 4:
    R1 = int(input('Введіть електричний опір першого провідника: '))
    R2 = int(input('Введіть електричний опір другого провідника: '))
    R3 = int(input('Введіть електричний опір третього провідника: '))
    R4 = int(input('Введіть електричний опір четвертого провідника: '))
    Rz = 1 / (1/R1 + 1/R2 + 1/R3 + 1/R4)
    print('Загальний електричний опір становить:', Rz, 'ом')
else: print('Провідників більш, ніж 4. Спочатку виправте код. :)')
